      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. OPERACIONES-BASICAS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  NUM1 PIC 9(4).
       01  NUM2 PIC 9(4).
       01  RESULTADO PIC 9(5).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Ingrese el primer numero:"
            ACCEPT NUM1.
            DISPLAY "Ingrese el segundo numero:"
            ACCEPT NUM2.
            ADD NUM1 TO NUM2 GIVING RESULTADO.
            SUBTRACT NUM1 FROM NUM2 GIVING RESULTADO.
            MULTIPLY NUM1 BY NUM2 GIVING RESULTADO.
            DIVIDE NUM1 BY NUM2 GIVING RESULTADO.
            DISPLAY "El resultado: " RESULTADO.
            STOP RUN.
       END PROGRAM OPERACIONES-BASICAS.
